icc/09_colaboracion_de_clases.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-17 Thu 14:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../inicio.html"> HOME </a>
</div><div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org217d167">1. Colaboración de clases</a>
<ul>
<li><a href="#org3ad37d7">1.1. Problema 1: Dados</a></li>
<li><a href="#orgf6c7e1c">1.2. Problema 2: Granja</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org217d167" class="outline-2">
<h2 id="org217d167"><span class="section-number-2">1.</span> Colaboración de clases</h2>
<div class="outline-text-2" id="text-1">
<p>
En programación, normalmente no se programa solamente una función o
una clase; siempre se programan módulos que utilizan varias clases que
se comunican y trabajan en conjunto para resolver un problema en
común.
</p>

<p>
El siguiente ejemplo separa funcionalidad de actividades en
clases. Simularemos un pequeño <i>Banco</i>. En un banco, hay <i>Clientes</i>
donde cada <i>Cliente</i> tiene su cuenta <i>independiente</i>. Un cliente puede
<i>retirar</i> y <i>abonar</i> a su cuenta la cantidad que desee. Por otra
parte, el banco maneja las operaciones de los clientes y puede
observar <i>su cuenta</i>. Omitiremos la completitud de los métodos por
espacio, pero solo tendremos los necesarios.
</p>

<p>
Clase <i>Cliente.java</i>
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Cliente</span> {
    <span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Nombre del cliente</span><span style="color: #7f7f7f;"> */</span>
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
    <span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Dinero en la cuenta</span><span style="color: #7f7f7f;"> */</span>
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">cuenta</span>;

    <span style="color: #00bfff;">public</span> Cliente(String nombre){
        <span style="color: #00bfff;">this</span>.nombre = nombre;
        <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">cuenta se inicializa en 0 autom&#225;ticamente
</span>    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">abonar</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">cantidad</span>){
        cuenta = cuenta + cantidad;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">retirar</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">cantidad</span>){
        cuenta = cuenta - cantidad;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">int</span> <span style="color: #daa520;">getCuenta</span>(){
        <span style="color: #00bfff;">return</span> cuenta;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">toString</span>(){
        <span style="color: #00bfff;">return</span> nombre + <span style="color: #deb887;">" tiene "</span> + cuenta + <span style="color: #deb887;">" en su cuenta."</span>;
    }
}
</pre>
</div>

<p>
Clase <i>Banco.java</i>
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Banco</span> {

    <span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Total de valor del banco</span><span style="color: #7f7f7f;"> */</span>
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">banca</span>;
    <span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">3 clientes en este banco</span><span style="color: #7f7f7f;"> */</span>
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">Cliente</span> <span style="color: #4eee94;">cliente1</span>, <span style="color: #4eee94;">cliente2</span>, <span style="color: #4eee94;">cliente3</span>;

    <span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Crearemos por omisi&#243;n a los clientes</span><span style="color: #7f7f7f;"> */</span>
    <span style="color: #00bfff;">public</span> Banco(){
        cliente1 = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Cliente</span>(<span style="color: #deb887;">"Aureliano"</span>);
        cliente2 = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Cliente</span>(<span style="color: #deb887;">"Gabriela"</span>);
        cliente3 = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Cliente</span>(<span style="color: #deb887;">"Canek"</span>);
        <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">banca = 0; se inicializa autom&#225;ticamente
</span>    }

    <span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Simularemos que estas operaciones fueron hechas por lo usuarios</span><span style="color: #7f7f7f;"> */</span>
    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">operar</span>(){
        cliente1.abonar(1422);
        cliente2.abonar(2339);
        cliente3.abonar(2149);
        cliente3.retirar(390);
        actualizaBanca();
    }

    <span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Suma el total que hay en la banca</span><span style="color: #7f7f7f;"> */</span>
    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">actualizaBanca</span>(){
        banca = cliente1.getCuenta() + cliente2.getCuenta() + cliente3.getCuenta();
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">toString</span>(){
        <span style="color: #00bfff;">return</span> <span style="color: #deb887;">"El valor total del banco es: "</span> + banca;
    }
}
</pre>
</div>

<p>
Clase <i>Main.java</i>
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Main</span> {
    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
        <span style="color: #98f5ff;">Banco</span> <span style="color: #4eee94;">banco1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Banco</span>();
        banco1.operar();
        banco1.toString();
    }
}
</pre>
</div>

<p>
Anteriormente vimos cómo crear varias clases y utilizarlas en la misma
carpeta, además de tener el método <code>main</code> separado en otra
clase. Analizaremos cada clase.
</p>

<p>
La clase <i>Cliente</i> se centra solamente en representar un <i>Cliente</i> del
banco, sus métodos y atributos son tales que <i>no se preocupa por los
demás clientes</i>, solo por abonar e ingresar dinero a su cuenta. Este
<i>objeto</i> su funcion es de un <i>cliente</i> y no más.
</p>

<p>
Por otro lado, la clase <i>Banco</i> <b>requiere</b> de la clase <i>Cliente</i> para
poder trabajar. Ya no guardamos dentro del banco a los <i>Clientes</i> como
un <i>String</i> o número, ya es un objeto de tipo <i>Cliente</i> y como tales,
ya pueden <i>operar</i> como <i>clientes</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">Cliente</span> <span style="color: #4eee94;">cliente1</span>, <span style="color: #4eee94;">cliente2</span>, <span style="color: #4eee94;">cliente3</span>;
</pre>
</div>
<p>
En <i>Java</i> podemos declarar varias variables en una misma línea.
</p>

<p>
Así, el banco <i>como objeto</i> o <i>entidad</i> puede leer y manipular <i>otros
objetos</i>, en este caso clientes que han sido previamente definidos por
nosostros mismos; claramente una <span class="underline">colaboración de clases</span>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">operar</span>(){
    cliente1.abonar(1422);
    cliente2.abonar(2339);
    cliente3.abonar(2149);
    cliente3.retirar(390);
    actualizaBanca();
}

<span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">actualizaBanca</span>(){
    banca = cliente1.getCuenta() + cliente2.getCuenta() + cliente3.getCuenta();
}
</pre>
</div>

<p>
Obviamente, un banco no tiene 3 clientes, ni 1000, Cada día va
cambiando el número de clientes, y como no podemos cambiar el código
<i>mientras se ejecuta</i> no podemos añadir más (o quitar) variables como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">Cliente</span> <span style="color: #4eee94;">cliente1</span>, <span style="color: #4eee94;">cliente2</span>, <span style="color: #4eee94;">cliente3</span>, <span style="color: #4eee94;">cliente4</span>, <span style="color: #4eee94;">cliente5</span> ...;
</pre>
</div>

<p>
Además de que sería muy tedioso hacer esto 1 x 1. Las <i>Estructuras de
datos</i> se centran en poder almacenar datos de manera que podamos
almacenar muchos objetos en una sola variable. Estas se estudiarán en
el curso de <i>Estructuras de datos</i>.
</p>


<p>
El <code>99.1421323%</code> de veces tendremos clases que <i>ocupan otras clases</i>,
más en general, programas crean programas. De hecho cada vez que
utilizamos una <i>String</i> o <i>Scanner</i>, estamos utilizando <i>otras clases</i>
que servirán para lo que queramos hacer. El otro <code>0.8578676999999999 %</code>
crearemos código desde 0, si estamos programando en <i>Ensamblador</i> o
<i>lenguaje de máquina</i> <code>0, 1</code>.
</p>


<p>
Por esta razón, el código hagamos debemos hacerlo con <i>calidad</i> y
<i>buenas prácticas</i> para que pueda ser utilizado por <i>otros
programadores</i> ya que somos hijos del <i>código libre</i> y licencias GNU.
</p>
</div>
<div id="outline-container-org3ad37d7" class="outline-3">
<h3 id="org3ad37d7"><span class="section-number-3">1.1.</span> Problema 1: Dados</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Crear una colaboración de clases que nos permita tirar 3 dados. Si la
suma de la tirada sale igual a 10, la casa gana, de otra forma gana el
jugador. Las clases son
</p>

<ul class="org-ul">
<li>Dado:
<ul class="org-ul">
<li>Atributos:
<ul class="org-ul">
<li>valorTirado: No puede ser más de 6</li>
</ul></li>
<li>Métodos:
<ul class="org-ul">
<li>Constructor vacío.</li>
<li>getters y setters</li>
<li><code>tirar()</code></li>
<li><code>toString()</code></li>
</ul></li>
</ul></li>
<li>Tirada:
<ul class="org-ul">
<li>Atributos:
<ul class="org-ul">
<li>3 Dados</li>
</ul></li>
<li>Métodos:
<ul class="org-ul">
<li>Constructor: Crea los dados solamente.</li>
<li>Tirar:  Debe imprimirse también lo que salió del dado para
evitar sospechas.</li>
</ul></li>
</ul></li>
<li>Main:
Crear un objeto <i>Tirada</i> ejecutar el método <code>tirar()</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgf6c7e1c" class="outline-3">
<h3 id="orgf6c7e1c"><span class="section-number-3">1.2.</span> Problema 2: Granja</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Crear una colaboración de clases para crear una <code>Granja</code>. La granja
deberá contener las clases: <i>Vaca, Pollo, Oveja, Puerco, Gato, y
Perro</i>. Cada uno de los animales deberá de tener los atributos:
</p>

<ul class="org-ul">
<li>Animal:
<ul class="org-ul">
<li>Atributos:
<ul class="org-ul">
<li>Nombre</li>
<li>Edad</li>
<li>Sexo</li>
</ul></li>
<li>Métodos:
<ul class="org-ul">
<li>Constructor: Incializa <code>nombre</code>. La edad es <i>aleatoria</i> entre
\([0, 10]\) y el sexo también.</li>
<li>getters y setters</li>
<li>toString</li>
<li><code>sonido()</code> Imprimir cómo <i>hace</i> el animal en cuestión.</li>
<li><p>
<code>reproducir(Animal pareja)</code>: Regresa una cria de esta especie,
cuyo nombre es la mitad del primero con la mitad restante del
segundo, edad es 0 y el <code>sexo</code> es aleatorio. Ej:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">Pollo</span> <span style="color: #daa520;">reproducir</span>(<span style="color: #98f5ff;">Pollo</span> <span style="color: #4eee94;">p</span>){
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">... reproducci&#243;n xd
</span>    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Nombre de Ferna-nda y Pa-blo
</span>    <span style="color: #00bfff;">return</span> <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Pollo</span>(<span style="color: #deb887;">"Ferna-blo"</span>, 0, sexo);
}
</pre>
</div></li>
</ul></li>
</ul></li>
</ul>


<p>
En la granja deben haber al menos 3 animales de cada especie. La
<i>Granja</i> nos debe localizar a los animales que son mayores a <b>4 años</b> y
si existen al menos un <i>macho</i> y una <i>hembra</i>, deben procrear
utilizando el método <code>reproducir()</code>. Imprimir al nuevo descendiente
con un mensaje de bienvenida al mundo.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-07-17 Thu 14:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
